Repository: diaaossam/beyond_manager
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Arabic
ar: عربى

source: English
ar: إنجليزى

# error_fetch_data
source: Error during communication
ar: حدث خطأ أثناء الاتصال بالخادم

# error_bad_request
source: Bad Request
ar: الطلب غير صالح

# error_bad_response
source: Bad response from server
ar: استجابة غير صحيحة من الخادم

# error_unauthorized
source: Unauthorized access
ar: غير مصرح لك بالوصول

# error_not_found
source: Not Found
ar: العنصر غير موجود

# error_conflict
source: Conflict occurred
ar: حدث تعارض

# error_internal_server
source: Internal server error
ar: خطأ في الخادم الداخلي

# error_no_internet
source: No internet connection
ar: لا يوجد اتصال بالإنترنت

# noData
source: No Data Found , please try again later
ar: لا توجد بيانات ، يرجى المحاولة مرة أخرى لاحقًا

source: Pick video
ar: التقط فيديو

source: Pick Image
ar: التقط صورة

# chooseFromGallery1
source: Choose Image
ar: اختر صورة

# chooseFromGallery2
source: Choose video
ar: اختر فيديو

source: Choose From Gallery
ar: اختر من المعرض

# thereIsError
source: There is An Error
ar: حدث خطأ

source: Back
ar: عودة

# searchHint
source: Search ...
ar: إبحث ...

# updateTitle
source: Update Available
ar: تحديث متاح

# updateBody
source: A new version of the app has been released with important improvements and fixes.
ar: تم إصدار نسخة جديدة من التطبيق تحتوي على تحسينات وإصلاحات مهمة.

# updateBody1
source: Faster performance and UI enhancements.
ar: أداء أسرع وتحسينات في الواجهة.

# updateBody2
source: Bug fixes.
ar: إصلاحات لأخطاء سابقة.

# updateBody3
source: Update Now
ar: تحديث الآن

# boardingTitle1
source: Easier Shopping
ar: تسوق أسهل

# boardingDescription1
source: Discover thousands of products and choose what suits you quickly and easily from anywhere.
ar: اكتشف آلاف المنتجات واختر اللي يناسبك بسهولة وسرعة من أي مكان.

# boardingTitle2
source: Daily Deals
ar: عروض يومية

# boardingDescription2
source: Don’t miss the strongest discounts and exclusive offers that get updated every day.
ar: متفوتش أقوى الخصومات والعروض الحصرية اللي بتتجدد كل يوم.

# boardingTitle3
source: Secure Payment & Fast Delivery
ar: دفع آمن وتوصيل سريع

# boardingDescription3
source: Pay safely and enjoy fast delivery right to your doorstep without any hassle.
ar: ادفع بأمان واستمتع بتوصيل سريع لحد باب البيت بدون أي تعب.

source: Start Now
ar: إبدء الأن

source: Phone Number
ar: رقم الهاتف

# validation
source: This field is required
ar: هذا الحقل مطلوب

source: Reset
ar: إعادة تعيين

# welcome1
source: Welcome to Beyond Manger
ar: مرحبًا بك في "بيوند مانجر"

# welcome2
source: Login into your account
ar: قم بتسجيل الدخول إلى حسابك

# enterPhoneNumber
source: Enter your mobile number
ar: أدخل رقم هاتفك المحمول

source: Already have account?
ar: لديك حساب بالفعل؟

source: Request Demo
ar: طلب عرض تجريبي

# iAgreeWith
source: By clicking "Create Account", you agree to
ar: بالضغط على "إنشاء حساب"، فإنك توافق على

source: Terms and Conditions
ar: الشروط والأحكام

source: and
ar: و

source: privacy policy
ar: سياسة الخصوصية

# app
source: For App
ar: للتطبيق

source: Full Name
ar: الاسم الكامل

source: Email Address
ar: البريد الإلكتروني

source: Job Title
ar: المسمى الوظيفي

source: Company Name
ar: اسم الشركة

source: Company Size
ar: حجم الشركة

# invalidEmail
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صحيح

# phoneValidation
source: Please enter valid phone number
ar: رقم الهاتف مطلوب

# noEmergenciesFound
source: No emergency requests found
ar: لا توجد طلبات طوارئ

source: Error loading data
ar: حدث خطأ أثناء تحميل البيانات

# policy_status_all
source: All
ar: الكل

# policy_status_active
source: Active
ar: نشط

# policy_status_expired
source: Expired
ar: منتهي

# policy_status_suspended
source: Suspended
ar: موقوف

# policy_status_terminated_with_insurance_company
source: Terminated with Insurance Company
ar: منتهي من شركة التأمين

# policy_status_under_issuance
source: Under Issuance
ar: قيد الإصدار

# policy_status_draft
source: Draft
ar: مسودة

# policy_status_terminated_with_beyond
source: Terminated With Beyond
ar: منتهي من بيوند

# policy_status_lapsed_bupa
source: Lapsed Bupa
ar: منتهي بوبا

# policy_status_cancel
source: Cancel
ar: ملغي

source: Select Doctor
ar: اختر الطبيب

source: Press back again to exit
ar: اضغط مرة أخرى للخروج من التطبيق

# additionAndDeletions
source: Additions & Deletions
ar: الإضافات والحذف

# manageMemberAdditionsDeletions
source: Manage member additions and deletions for your insurance policies
ar: إدارة إضافات وحذف الأعضاء لوثائق التأمين الخاصة بك

source: Create New Request
ar: إنشاء طلب جديد

# createNewRequestDesc
source: Submit a new addition or deletion request for your members. Choose between manual entry or bulk template upload.
ar: تقديم طلب إضافة أو حذف جديد لأعضائك. اختر بين الإدخال اليدوي أو تحميل القالب المجمع.

source: Get Started
ar: ابدأ الآن

source: View / Track Requests
ar: عرض / تتبع الطلبات

# viewTrackRequestsDesc
source: Monitor the status of your submitted requests and view the complete history of all additions and deletions.
ar: راقب حالة طلباتك المقدمة واعرض السجل الكامل لجميع الإضافات والحذف.

source: Select Insurance Policies
ar: اختر وثائق التأمين

# chooseWhichInsurancePolicies
source: Choose which insurance policies you want to apply this action to
ar: اختر وثائق التأمين التي تريد تطبيق هذا الإجراء عليها

# noteLabel
source: Note:
ar: ملاحظة:

# noteSameMembersProcessed
source: The same members will be processed for all selected policies. Select all policies you want to include in this request.
ar: سيتم معالجة نفس الأعضاء لجميع الوثائق المحددة. حدد جميع الوثائق التي تريد تضمينها في هذا الطلب.

source: Active Policies
ar: الوثائق النشطة

# selectOneOrMorePolicies
source: Select one or more policies to apply this action
ar: حدد وثيقة واحدة أو أكثر لتطبيق هذا الإجراء

source: Selected:
ar: المحدد:

source: Continue to Method Selection
ar: المتابعة لاختيار الطريقة

source: Select Request Type
ar: اختر نوع الطلب

# chooseTypeOfAction
source: Choose the type of action you want to perform
ar: اختر نوع الإجراء الذي تريد تنفيذه

source: Addition Only
ar: إضافة فقط

# additionOnlyDesc
source: Add new members to the selected insurance policies. Perfect for onboarding new employees or adding family members.
ar: إضافة أعضاء جدد إلى وثائق التأمين المحددة. مثالي لتوظيف موظفين جدد أو إضافة أفراد الأسرة.

source: Select Addition
ar: اختر الإضافة

source: Deletion Only
ar: حذف فقط

# deletionOnlyDesc
source: Remove existing members from the selected insurance policies. Used for terminations or coverage changes.
ar: إزالة الأعضاء الحاليين من وثائق التأمين المحددة. يستخدم للإنهاء أو تغييرات التغطية.

source: Select Deletion
ar: اختر الحذف

source: Both
ar: كلاهما

# bothDesc
source: Perform both additions and deletions in a single request. Efficient for bulk policy updates.
ar: تنفيذ كل من الإضافات والحذف في طلب واحد. فعال لتحديثات الوثائق المجمعة.

source: Select Both
ar: اختر كلاهما

# continueButton
source: Continue
ar: متابعة

source: Select Method
ar: اختر الطريقة

source: Manual Entry
ar: الإدخال اليدوي

# manualEntryDesc
source: Fill out forms on the platform to add members one by one. Best for small numbers of members.
ar: املأ النماذج على المنصة لإضافة الأعضاء واحدًا تلو الآخر. الأفضل لعدد صغير من الأعضاء.

# guidedStepByStep
source: Guided step-by-step process
ar: عملية موجهة خطوة بخطوة

source: Instant field validation
ar: التحقق الفوري من الحقول

# perfectFor1To10Members
source: Perfect for 1-10 members
ar: مثالي لـ 1-10 أعضاء

source: Proceed with Manual Entry
ar: المتابعة بالإدخال اليدوي

source: Template Upload
ar: تحميل القالب

# templateUploadDesc
source: Download our Excel template, fill it offline, and upload for bulk processing. Best for large numbers.
ar: قم بتنزيل قالب Excel الخاص بنا، املأه بلا اتصال، وقم بتحميله للمعالجة المجمعة. الأفضل للأعداد الكبيرة.

source: Efficient bulk processing
ar: معالجة مجمعة فعالة

source: Comprehensive error reporting
ar: تقارير أخطاء شاملة

# perfectFor10PlusMembers
source: Perfect for 10+ members
ar: مثالي لـ 10+ أعضاء

source: Proceed with Template
ar: المتابعة بالقالب

source: Add Members Manually
ar: إضافة الأعضاء يدويًا

# fillOutMemberDetails
source: Fill out member details below. You can add multiple members in one request.
ar: املأ تفاصيل الأعضاء أدناه. يمكنك إضافة عدة أعضاء في طلب واحد.

source: Selected Policies:
ar: الوثائق المحددة:

source: Medical Insurance
ar: التأمين الطبي

source: Tip:
ar: نصيحة:

# allDataValidatedInstantly
source: All data is validated instantly. You'll see real-time feedback if there are any errors in your entries.
ar: يتم التحقق من جميع البيانات على الفور. سترى ملاحظات فورية إذا كانت هناك أي أخطاء في إدخالاتك.

source: Add Another Member
ar: إضافة عضو آخر

source: Submit Request
ar: إرسال الطلب

source: Member #
ar: العضو #

source: Relationship
ar: العلاقة

source: Select Relationship
ar: اختر العلاقة

source: Spouse
ar: الزوج/الزوجة

source: Child
ar: الطفل

source: Full Name (Arabic)
ar: الاسم الكامل (عربي)

source: Full Name (English)
ar: الاسم الكامل (إنجليزي)

source: Member Full Name
ar: اسم العضو الكامل

source: Nationality
ar: الجنسية

source: Egyptian
ar: مصري

source: Non-Egyptian
ar: غير مصري

source: National ID (CNID)
ar: الرقم القومي

# nationalIdHint
source: 14-digit National ID
ar: الرقم القومي المكون من 14 رقم

source: Date of Birth
ar: تاريخ الميلاد

source: DD/MM/YYYY
ar: يوم/شهر/سنة

source: Hiring Date
ar: تاريخ التوظيف

source: Addition Date
ar: تاريخ الإضافة

source: Marital Status
ar: الحالة الاجتماعية

source: Select Status
ar: اختر الحالة

source: Single
ar: أعزب

source: Married
ar: متزوج

source: Select Gender
ar: اختر الجنس

# phoneNumberHint
source: Enter your Phone Number
ar: 01XXXXXXXXX

source: Insurance Plans
ar: خطط التأمين

source: Medical Insurance Plan
ar: خطة التأمين الطبي

source: Life Insurance Plan
ar: خطة التأمين على الحياة

source: Dental Insurance Plan
ar: خطة تأمين الأسنان

source: Vision Care Plan
ar: خطة العناية بالبصر

# selectPlan
source: Select Medical Insurance Plan
ar: اختر خطة تأمين

source: Premium Plan
ar: الخطة المميزة

source: Standard Plan
ar: الخطة القياسية

source: Salary (Conditional)
ar: الراتب (مشروط)

source: Monthly Salary
ar: الراتب الشهري

source: IBAN (Conditional)
ar: رقم الآيبان (مشروط)

source: Full Address
ar: العنوان الكامل

source: Photo Upload
ar: تحميل الصورة

source: Automatically renamed with Staff Number
ar: يتم إعادة تسميتها تلقائيًا برقم الموظف

source: Acknowledgment Statement
ar: بيان الإقرار

# uploadSignedAcknowledgment
source: Upload signed acknowledgment document (PDF, Image, or Word)
ar: قم بتحميل مستند الإقرار الموقع (PDF أو صورة أو Word)

source: Staff Number (ID)
ar: رقم الموظف (المعرف)

source: Employee Staff Number
ar: رقم موظف الموظف

source: Choose File
ar: اختر الملف

source: No file chosen
ar: لم يتم اختيار أي ملف

# uploadYourFilledTemplate
source: Upload your filled template and supporting documents
ar: قم بتحميل القالب المملوء والمستندات الداعمة

# guidelinesOfAdditionAndDeletion
source: Guidelines of Addition and Deletion for Insurance Company
ar: إرشادات الإضافة والحذف لشركة التأمين

source: Step 1: Download Template
ar: الخطوة 1: تنزيل القالب

# downloadExcelTemplate
source: Download the Excel template and fill it with member information
ar: قم بتنزيل قالب Excel واملأه بمعلومات الأعضاء

source: Download Template
ar: تنزيل القالب

source: Step 2: Upload Filled Template
ar: الخطوة 2: تحميل القالب المملوء

source: Upload your completed Excel template
ar: قم بتحميل قالب Excel المكتمل الخاص بك

source: Upload Excel Template
ar: تحميل قالب Excel

source: Click to select your filled template
ar: انقر لتحديد القالب المملوء الخاص بك

# acceptedFormatsXlsx
source: Accepted formats: .xlsx, .xls
ar: التنسيقات المقبولة: .xlsx, .xls

source: Step 3: Upload Member Photos
ar: الخطوة 3: تحميل صور الأعضاء

# uploadPhotosForAllMembers
source: Upload photos for all members in the template
ar: قم بتحميل الصور لجميع الأعضاء في القالب

source: IMPORTANT NAMING CONVENTION:
ar: اتفاقية التسمية المهمة:

source: • Photos must be named with Staff ID
ar: • يجب تسمية الصور برقم الموظف

# formatStaffIdJpg
source: • Format:
ar: • التنسيق:

# staffIdJpgFormat
source: [StaffID].jpg
ar: [رقم الموظف].jpg

# orLabel
source: or
ar: أو

# staffIdPngFormat
source: [StaffID].png
ar: [رقم الموظف].png

# exampleLabel
source: • Example:
ar: • مثال:

source: Upload Member Photos
ar: تحميل صور الأعضاء

# clickToSelectMultiplePhotos
source: Click to select multiple photos or drag and drop
ar: انقر لتحديد عدة صور أو اسحب وأفلت

# acceptedFormatsJpgPng
source: Accepted formats: JPG, PNG | Max size: 5MB per photo
ar: التنسيقات المقبولة: JPG, PNG | الحد الأقصى: 5 ميجابايت لكل صورة

# photosSelected
source: {count} photo(s) selected
ar: {count} صورة محددة

source: Step 4: Upload Supporting Documents
ar: الخطوة 4: تحميل المستندات الداعمة

# uploadDocumentsForFamilyMembers
source: Upload documents for family members (birth certificates, marriage certificates, etc.)
ar: قم بتحميل المستندات لأفراد الأسرة (شهادات الميلاد، شهادات الزواج، إلخ.)

source: • Documents must be named with Staff ID
ar: • يجب تسمية المستندات برقم الموظف

# formatStaffIdDocumentType
source: [StaffID]_[DocumentType].pdf
ar: [رقم الموظف]_[نوع المستند].pdf

source: • Examples:
ar: • أمثلة:

source: Upload Supporting Documents
ar: تحميل المستندات الداعمة

# clickToSelectMultipleDocuments
source: Click to select multiple documents or drag and drop
ar: انقر لتحديد عدة مستندات أو اسحب وأفلت

# acceptedFormatsPdfJpgPng
source: Accepted formats: PDF, JPG, PNG | Max size: 10MB per file
ar: التنسيقات المقبولة: PDF, JPG, PNG | الحد الأقصى: 10 ميجابايت لكل ملف

# documentsSelected
source: {count} document(s) selected
ar: {count} مستند محدد

source: Step 5: Foreign Employee Acknowledgement
ar: الخطوة 5: إقرار الموظف الأجنبي

source: Required if template includes foreign employees
ar: مطلوب إذا كان القالب يتضمن موظفين أجانب

source: Required for Foreign Employees:
ar: مطلوب للموظفين الأجانب:

# ifYourTemplateIncludesForeignEmployees
source: If your template includes
ar: إذا كان القالب الخاص بك يتضمن

source: foreign employees
ar: موظفين أجانب

# youMustUploadSignedAcknowledgement
source: , you must upload a signed acknowledgement confirming their current employment status.
ar: ، فيجب عليك تحميل إقرار موقع يؤكد حالة توظيفهم الحالية.

source: Download Foreign Employee Acknowledgement Template
ar: تنزيل قالب إقرار الموظف الأجنبي

source: Upload Signed Acknowledgement
ar: تحميل الإقرار الموقع

# requiredIfAddingForeignEmployees
source: Required if adding foreign employees | Click to select or drag and drop
ar: مطلوب في حالة إضافة موظفين أجانب | انقر للتحديد أو اسحب وأفلت

# acceptedFormatsPdfJpgPngMaxSize
source: Accepted formats: PDF, JPG, PNG | Max size: 10MB
ar: التنسيقات المقبولة: PDF, JPG, PNG | الحد الأقصى: 10 ميجابايت

source: Send Request
ar: إرسال الطلب

source: Please upload the filled Excel template
ar: يرجى تحميل قالب Excel المملوء

# monitorAllYourAdditionDeletionRequests
source: Monitor and track all your addition and deletion requests
ar: راقب وتتبع جميع طلبات الإضافة والحذف الخاصة بك

source: SUBMITTED REQUESTS
ar: الطلبات المقدمة

source: PENDING REVIEW
ar: قيد المراجعة

source: WAITING FOR HR
ar: في انتظار الموارد البشرية

source: Completed
ar: مكتمل

source: Search Requests
ar: البحث عن الطلبات

source: Request Number
ar: رقم الطلب

source: Member Name
ar: اسم العضو

source: Staff id
ar: رقم الموظف

# showingLabel
source: Showing:
ar: عرض:

# submittedRequestsCount
source: {count} Submitted Requests
ar: {count} طلب مقدم

# lastUpdatedLabel
source: Last Updated:
ar: آخر تحديث:

source: Request History
ar: سجل الطلبات

source: Back to Dashboard
ar: العودة إلى لوحة التحكم

source: Addition Request
ar: طلب إضافة

source: Waiting HR
ar: في انتظار الموارد البشرية

source: Action Required
ar: مطلوب إجراء

# reasonLabel
source: Reason:
ar: السبب:

source: What to do:
ar: ماذا تفعل:

# submissionDateLabel
source: SUBMISSION D...
ar: تاريخ التقديم...

# policiesAffectedLabel
source: POLICIES AFFE...
ar: الوثائق المتأثرة...

# membersCountLabel
source: MEMBERS COU...
ar: عدد الأعضاء...

source: WAITING SINCE
ar: في الانتظار منذ

source: View Details
ar: عرض التفاصيل

source: Download Excel Report
ar: تنزيل تقرير Excel

source: Contact Support
ar: الاتصال بالدعم

source: Select Members to Delete
ar: اختر الأعضاء للحذف

# searchAndSelectMembers
source: Search and select members - families will be auto-selected
ar: ابحث واختر الأعضاء - سيتم تحديد العائلات تلقائيًا

# viewDeletionGuidelines
source: View Deletion Guidelines for Selected Insurance
ar: عرض إرشادات الحذف للتأمين المحدد

# importantLabel
source: Important:
ar: مهم:

# selectingPrincipalMemberAutoSelects
source: Selecting a principal member will automatically select all their family members. They must be deleted together as a family unit.
ar: سيؤدي تحديد العضو الرئيسي إلى تحديد جميع أفراد أسرته تلقائيًا. يجب حذفهم معًا كوحدة عائلية.

source: Search Active Members
ar: البحث عن الأعضاء النشطين

source: National ID (CNID)
ar: الرقم القومي

# selectedMembers
source: Selected: {count} Members
ar: المحدد: {count} عضو

source: Principal
ar: رئيسي

# staffIdLabel
source: Staff ID:
ar: رقم الموظف:

# nationalIdLabel
source: National ID:
ar: الرقم القومي:

# nationalityLabel
source: Nationality:
ar: الجنسية:

# cardNumber
source: Card Number: {number}
ar: رقم البطاقة: {number}

# hasFamilyMembersAutoSelected
source: Has {count} family members - will be auto-selected
ar: لديه {count} أفراد من العائلة - سيتم التحديد تلقائيًا

source: Template Validation Guidelines
ar: إرشادات التحقق من القالب

source: Addition and Deletion for Insurance Company
ar: الإضافة والحذف لشركة التأمين

source: Important Notice
ar: إشعار مهم

# ensureAllDataComplies
source: Please ensure all data complies with these guidelines before submitting your template to avoid delays or rejections.
ar: يرجى التأكد من أن جميع البيانات تتوافق مع هذه الإرشادات قبل تقديم القالب الخاص بك لتجنب التأخير أو الرفض.

source: General Requirements
ar: المتطلبات العامة

source: Template Format:
ar: تنسيق القالب:

# useOnlyOfficialExcelTemplate
source: Use only the official Excel template provided (.xlsx or .xls)
ar: استخدم فقط قالب Excel الرسمي المقدم (.xlsx أو .xls)

source: Required Fields:
ar: الحقول المطلوبة:

# allFieldsMarkedWithAsterisk
source: All fields marked with asterisk (*) must be filled
ar: يجب ملء جميع الحقول المميزة بعلامة النجمة (*)

source: Data Accuracy:
ar: دقة البيانات:

# verifyAllInformationForAccuracy
source: Verify all information for accuracy before submission
ar: تحقق من جميع المعلومات للحصول على الدقة قبل التقديم

source: File Size:
ar: حجم الملف:

source: Maximum template size is 10MB
ar: الحد الأقصى لحجم القالب هو 10 ميجابايت

source: Character Encoding:
ar: ترميز الأحرف:

source: Use UTF-8 encoding for Arabic text
ar: استخدم ترميز UTF-8 للنص العربي

source: Addition Guidelines
ar: إرشادات الإضافة

# staffIdMustBeUnique
source: Must be unique and not exist in the system
ar: يجب أن يكون فريدًا وغير موجود في النظام

# nationalIdMustBe14Digits
source: Must be 14 digits for Egyptian nationals
ar: يجب أن يكون 14 رقمًا للمصريين

# dateOfBirthFormatDDMMYYYY
source: Format must be DD/MM/YYYY
ar: يجب أن يكون التنسيق يوم/شهر/سنة

# phoneNumbersMustStart01
source: Must start with 01 and be 11 digits
ar: يجب أن يبدأ بـ 01 ويكون 11 رقمًا

# emailMustBeValid
source: Must be valid company or personal email
ar: يجب أن يكون بريدًا إلكترونيًا صالحًا للشركة أو شخصيًا

# photosFileNaming
source: File naming must match Staff ID (e.g., 123456.jpg)
ar: يجب أن تتطابق تسمية الملف مع رقم الموظف (على سبيل المثال، 123456.jpg)

source: Maximum Members:
ar: الحد الأقصى للأعضاء:

# upTo100MembersPerTemplate
source: Up to 100 members per template submission
ar: ما يصل إلى 100 عضو لكل قالب مقدم

source: Deletion Guidelines
ar: إرشادات الحذف

source: Member Verification:
ar: التحقق من العضو:

# membersMustExistInActiveList
source: Members must exist in the Active List
ar: يجب أن يكون الأعضاء موجودين في القائمة النشطة

source: Deletion Reason:
ar: سبب الحذف:

source: Must provide valid reason for deletion
ar: يجب تقديم سبب صالح للحذف

source: Effective Date:
ar: تاريخ السريان:

source: Specify when deletion should take effect
ar: حدد متى يجب أن يسري الحذف

source: Dependent Warning:
ar: تحذير التابعين:

# deletingPrincipalAutomaticallyRemoves
source: Deleting principal automatically removes all dependents
ar: حذف العضو الرئيسي يزيل تلقائيًا جميع التابعين

source: Photo Requirements
ar: متطلبات الصورة

source: Format:
ar: التنسيق:

source: JPG or PNG only
ar: JPG أو PNG فقط

source: Size:
ar: الحجم:

source: Maximum 5MB per photo
ar: الحد الأقصى 5 ميجابايت لكل صورة

source: Resolution:
ar: الدقة:

# minimum300x300Pixels
source: Minimum 300x300 pixels, recommended 600x600
ar: الحد الأدنى 300×300 بكسل، موصى به 600×600

source: Background:
ar: الخلفية:

# whiteOrLightColoredBackground
source: White or light-colored background preferred
ar: الخلفية البيضاء أو ذات الألوان الفاتحة مفضلة

source: Naming Convention:
ar: اتفاقية التسمية:

source: [StaffID].jpg or [StaffID].png
ar: [رقم الموظف].jpg أو [رقم الموظف].png

source: Photo Quality:
ar: جودة الصورة:

# clearRecentPhoto
source: Clear, recent photo (not older than 6 months)
ar: صورة واضحة وحديثة (لا تزيد عن 6 أشهر)

source: Document Requirements
ar: متطلبات المستند

# pdfJpgPngAccepted
source: PDF, JPG, or PNG accepted
ar: PDF, JPG أو PNG مقبول

source: Maximum 10MB per document
ar: الحد الأقصى 10 ميجابايت لكل مستند

source: Naming:
ar: التسمية:

# staffIdDocumentTypePdf
source: [StaffID]_[DocumentType].pdf (e.g., 123456_BirthCertificate.pdf)
ar: [رقم الموظف]_[نوع المستند].pdf (على سبيل المثال، 123456_BirthCertificate.pdf)

source: Required Documents:
ar: المستندات المطلوبة:

# birthCertificatesForChildren
source: Birth certificates for children, marriage certificates for spouse
ar: شهادات الميلاد للأطفال، شهادات الزواج للزوج/الزوجة

source: Legibility:
ar: الوضوح:

# allDocumentsMustBeClear
source: All documents must be clear and readable
ar: يجب أن تكون جميع المستندات واضحة وقابلة للقراءة

source: Language
ar: اللغة:

# arabicOrEnglishDocuments
source: Arabic or English documents accepted
ar: المستندات العربية أو الإنجليزية مقبولة

source: Validation Process
ar: عملية التحقق

# onceSubmittedYourTemplate
source: Once submitted, your template will be automatically validated against these guidelines. Any errors or missing information will be flagged, and you will be notified within 24 hours. Properly formatted submissions are processed faster.
ar: بمجرد التقديم، سيتم التحقق من القالب الخاص بك تلقائيًا وفقًا لهذه الإرشادات. سيتم الإشارة إلى أي أخطاء أو معلومات مفقودة، وسيتم إخطارك خلال 24 ساعة. يتم معالجة التقديمات المنسقة بشكل صحيح بشكل أسرع.

source: Close Guidelines
ar: إغلاق الإرشادات

# deletionGuidelinesTitle
source: Deletion Guidelines
ar: إرشادات الحذف

source: For Selected Insurance Policies
ar: للوثائق التأمينية المحددة

# deletingPrincipalMemberWillAutomatically
source: Deleting a principal member will automatically remove all associated family members. This action cannot be undone.
ar: سيؤدي حذف العضو الرئيسي تلقائيًا إلى إزالة جميع أفراد الأسرة المرتبطين. لا يمكن التراجع عن هذا الإجراء.

source: Deletion Requirements
ar: متطلبات الحذف

# membersMustExistInActiveListAndValid
source: Members must exist in the Active List and have a valid active status
ar: يجب أن يكون الأعضاء موجودين في القائمة النشطة ولديهم حالة نشطة صالحة

# mustProvideValidReasonForDeletionDesc
source: Must provide a valid reason for deletion (e.g., termination, retirement, voluntary withdrawal)
ar: يجب تقديم سبب صالح للحذف (على سبيل المثال، الإنهاء، التقاعد، الانسحاب الطوعي)

# specifyWhenDeletionShouldTakeEffectDesc
source: Specify when deletion should take effect. Cannot be in the past
ar: حدد متى يجب أن يسري الحذف. لا يمكن أن يكون في الماضي

source: Family Unit Warning:
ar: تحذير الوحدة العائلية:
