Repository: diaaossam/beyond_manager
Catalog: lib/l10n/intl_*.arb
Languages: ar

# deletingPrincipalAutomaticallyRemovesDesc
source: Deleting principal automatically removes all dependents (spouse, children)
ar: حذف العضو الرئيسي يزيل تلقائيًا جميع التابعين (الزوج/الزوجة، الأطفال)

source: Policy Coverage:
ar: تغطية الوثيقة:

# memberMustHaveCompletedMinimumCoverage
source: Member must have completed the minimum coverage period as per policy terms
ar: يجب أن يكون العضو قد أكمل فترة التغطية الدنيا حسب شروط الوثيقة

source: Deletion Process
ar: عملية الحذف

# step1SearchAndSelectMembers
source: Search and select members from Active List
ar: ابحث واختر الأعضاء من القائمة النشطة

# step2SystemAutoSelectsFamilyMembers
source: System auto-selects all family members for principal
ar: النظام يحدد تلقائيًا جميع أفراد الأسرة للعضو الرئيسي

# step3ProvideDeletionReason
source: Provide deletion reason and effective date
ar: قدم سبب الحذف وتاريخ السريان

# step4SubmitDeletionRequest
source: Submit deletion request for approval
ar: قدم طلب الحذف للموافقة

# step5InsuranceCompanyProcesses
source: Insurance company processes and confirms deletion
ar: شركة التأمين تعالج وتؤكد الحذف

source: Important Notes
ar: ملاحظات مهمة

source: Batch Deletion:
ar: الحذف المجمع:

# youCanSelectMultipleMembers
source: You can select multiple members for deletion in one request
ar: يمكنك تحديد عدة أعضاء للحذف في طلب واحد

source: Coverage End:
ar: نهاية التغطية:

# insuranceCoverageEndsOnSpecifiedDate
source: Insurance coverage ends on the specified effective date
ar: تنتهي تغطية التأمين في تاريخ السريان المحدد

source: Refunds:
ar: المبالغ المستردة:

# refundEligibilityDependsOnPolicyTerms
source: Refund eligibility depends on policy terms and effective date
ar: أهلية الاسترداد تعتمد على شروط الوثيقة وتاريخ السريان

source: Re-enrollment:
ar: إعادة التسجيل:

# deletedMembersMayBeReEnrolled
source: Deleted members may be re-enrolled following standard addition procedures
ar: يمكن إعادة تسجيل الأعضاء المحذوفين باتباع إجراءات الإضافة القياسية

source: Notification:
ar: الإشعار:

# affectedMembersWillBeNotified
source: Affected members will be notified of deletion via email/SMS
ar: سيتم إخطار الأعضاء المتأثرين بالحذف عبر البريد الإلكتروني/الرسائل النصية القصيرة

# validationAndApproval
source: Validation & Approval
ar: التحقق والموافقة

# allDeletionRequestsAreValidated
source: All deletion requests are validated against policy rules and require approval from the insurance company. You will be notified of the status within 24-48 hours.
ar: يتم التحقق من جميع طلبات الحذف وفقًا لقواعد الوثيقة وتتطلب الموافقة من شركة التأمين. سيتم إخطارك بالحالة خلال 24-48 ساعة.

source: Alert Configuration
ar: إعداد التنبيهات

source: Total Consumption Threshold
ar: حد الاستهلاك الإجمالي

# totalConsumptionThresholdDescription
source: Alert when total company consumption reaches this amount.
ar: تنبيه عند وصول استهلاك الشركة الإجمالي إلى هذا المبلغ.

source: Monthly Consumption Threshold
ar: حد الاستهلاك الشهري

# monthlyConsumptionThresholdDescription
source: Alert when consumption in a specific month reaches this amount.
ar: تنبيه عند وصول الاستهلاك في شهر معين إلى هذا المبلغ.

source: Employee Amount Threshold
ar: حد مبلغ الموظف

# employeeAmountThresholdDescription
source: Alert when any employee's total consumption reaches this amount.
ar: تنبيه عند وصول إجمالي استهلاك أي موظف إلى هذا المبلغ.

source: Employee Transaction Count Threshold
ar: حد عدد معاملات الموظف

# employeeTransactionCountThresholdDescription
source: Alert when any employee's number of transactions reaches this count.
ar: تنبيه عند وصول عدد معاملات أي موظف إلى هذا العدد.

# unitEg
source: EG
ar: ج.م

# unitCount
source: Count
ar: عدد

source: Utilization Notifications
ar: إشعارات الاستخدام

source: Deep Dive Study
ar: دراسة التعمق

source: Request new deep dive study
ar: طلب دراسة تعمق جديدة
